In [1]:
import numpy as np
from pandas import Series

In [2]:
a=np.array([1,2,3,np.nan])

In [3]:
a.sum()

nan

In [4]:
s = Series(a)

In [5]:
s.sum()

6.0

# FIND MISSING VALUES

In [6]:
from pandas import DataFrame, Series

In [7]:
index=['a', 'b', 'c', 'd']

s1 = Series({'a':1 , 'c':3, 'd':4})

s2=Series([3.5,4.5], index=index[2:])

d = {'A':s1, 'B':s2}

In [8]:
df = DataFrame(d, index=index)
df

     A    B
a  1.0  NaN
b  NaN  NaN
c  3.0  3.5
d  4.0  4.5

In [9]:
#Boolean mask for all null values:
#np.nan and None.
#Use notnull method for the inverse
df.isnull()

       A      B
a  False   True
b   True   True
c  False  False
d  False  False

# REMOVE/REPLACE NaN

In [10]:
#Replace missing values manually
from pandas import isnull
df[isnull(df)]=0

In [11]:
df

     A    B
a  1.0  0.0
b  0.0  0.0
c  3.0  3.5
d  4.0  4.5

In [12]:
#Inverse operation
df[df == 0] = np.nan
df

     A    B
a  1.0  NaN
b  NaN  NaN
c  3.0  3.5
d  4.0  4.5

In [13]:
#Fill na from previous value
df.fillna(method='ffill')

     A    B
a  1.0  NaN
b  1.0  NaN
c  3.0  3.5
d  4.0  4.5

In [14]:
#Remove all rows with missing values
df.dropna(how='all')

     A    B
a  1.0  NaN
c  3.0  3.5
d  4.0  4.5

In [15]:
df.dropna(how='any')

     A    B
c  3.0  3.5
d  4.0  4.5

# Interpolate Nans away

In [16]:
df.interpolate()

     A    B
a  1.0  NaN
b  2.0  NaN
c  3.0  3.5
d  4.0  4.5